; domain
(define (domain blocksworld-4ops)
  (:requirements :strips)
  (:predicates
    (clear ?x)
    (on-table ?x)
    (arm-empty)
    (holding ?x)
    (on ?x ?y)
  )

  (:action pickup
    :parameters (?ob)
    :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
    :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
      (not (arm-empty)))
  )

  (:action putdown
    :parameters (?ob)
    :precondition (holding ?ob)
    :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
      (not (holding ?ob)))
  )

  (:action stack
    :parameters (?ob ?underob)
    :precondition (and (clear ?underob) (holding ?ob))
    :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
      (not (clear ?underob)) (not (holding ?ob)))
  )

  (:action unstack
    :parameters (?ob ?underob)
    :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
    :effect (and (holding ?ob) (clear ?underob)
      (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))
  )
)

; problem
(define (problem BW-rand-25)
(:domain blocksworld-4ops)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 )
(:init
(arm-empty)
(on b1 b5)
(on b2 b1)
(on b3 b22)
(on b4 b14)
(on b5 b23)
(on b6 b15)
(on b7 b12)
(on b8 b21)
(on-table b9)
(on b10 b16)
(on-table b11)
(on b12 b17)
(on b13 b11)
(on-table b14)
(on-table b15)
(on b16 b8)
(on b17 b24)
(on b18 b19)
(on-table b19)
(on b20 b6)
(on b21 b9)
(on b22 b2)
(on b23 b4)
(on b24 b20)
(on b25 b18)
(clear b3)
(clear b7)
(clear b10)
(clear b13)
(clear b25)
)
(:goal
(and
(on b1 b6)
(on b2 b17)
(on b3 b18)
(on b5 b8)
(on b6 b19)
(on b7 b13)
(on b9 b5)
(on b10 b25)
(on b11 b4)
(on b13 b24)
(on b14 b16)
(on b15 b10)
(on b17 b12)
(on b18 b2)
(on b19 b14)
(on b20 b21)
(on b22 b11)
(on b23 b7)
(on b24 b22))
)
)

; plan
1. (unstack b10 b16)
   deleted: (on b10 b16) (clear b10) (arm-empty)
   added: (holding b10) (clear b16)
   goals met: 0 of 19
2. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 0 of 19
3. (unstack b16 b8)
   deleted: (on b16 b8) (clear b16) (arm-empty)
   added: (holding b16) (clear b8)
   goals met: 0 of 19
4. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 0 of 19
5. (unstack b8 b21)
   deleted: (on b8 b21) (clear b8) (arm-empty)
   added: (holding b8) (clear b21)
   goals met: 0 of 19
6. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 19
7. (unstack b21 b9)
   deleted: (on b21 b9) (clear b21) (arm-empty)
   added: (holding b21) (clear b9)
   goals met: 0 of 19
8. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 0 of 19
9. (unstack b13 b11)
   deleted: (on b13 b11) (clear b13) (arm-empty)
   added: (holding b13) (clear b11)
   goals met: 0 of 19
10. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 19
11. (unstack b3 b22)
   deleted: (on b3 b22) (clear b3) (arm-empty)
   added: (holding b3) (clear b22)
   goals met: 0 of 19
12. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 0 of 19
13. (unstack b22 b2)
   deleted: (on b22 b2) (clear b22) (arm-empty)
   added: (holding b22) (clear b2)
   goals met: 0 of 19
14. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 0 of 19
15. (unstack b2 b1)
   deleted: (on b2 b1) (clear b2) (arm-empty)
   added: (holding b2) (clear b1)
   goals met: 0 of 19
16. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 0 of 19
17. (unstack b1 b5)
   deleted: (on b1 b5) (clear b1) (arm-empty)
   added: (holding b1) (clear b5)
   goals met: 0 of 19
18. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 0 of 19
19. (unstack b5 b23)
   deleted: (on b5 b23) (clear b5) (arm-empty)
   added: (holding b5) (clear b23)
   goals met: 0 of 19
20. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 19
21. (unstack b23 b4)
   deleted: (on b23 b4) (clear b23) (arm-empty)
   added: (holding b23) (clear b4)
   goals met: 0 of 19
22. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 0 of 19
23. (unstack b4 b14)
   deleted: (on b4 b14) (clear b4) (arm-empty)
   added: (holding b4) (clear b14)
   goals met: 0 of 19
24. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 19
25. (unstack b7 b12)
   deleted: (on b7 b12) (clear b7) (arm-empty)
   added: (holding b7) (clear b12)
   goals met: 0 of 19
26. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 19
27. (unstack b12 b17)
   deleted: (on b12 b17) (clear b12) (arm-empty)
   added: (holding b12) (clear b17)
   goals met: 0 of 19
28. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 0 of 19
29. (unstack b17 b24)
   deleted: (on b17 b24) (clear b17) (arm-empty)
   added: (holding b17) (clear b24)
   goals met: 0 of 19
30. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 0 of 19
31. (unstack b24 b20)
   deleted: (on b24 b20) (clear b24) (arm-empty)
   added: (holding b24) (clear b20)
   goals met: 0 of 19
32. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 0 of 19
33. (unstack b20 b6)
   deleted: (on b20 b6) (clear b20) (arm-empty)
   added: (holding b20) (clear b6)
   goals met: 0 of 19
34. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 0 of 19
35. (unstack b6 b15)
   deleted: (on b6 b15) (clear b6) (arm-empty)
   added: (holding b6) (clear b15)
   goals met: 0 of 19
36. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 0 of 19
37. (unstack b25 b18)
   deleted: (on b25 b18) (clear b25) (arm-empty)
   added: (holding b25) (clear b18)
   goals met: 0 of 19
38. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 0 of 19
39. (unstack b18 b19)
   deleted: (on b18 b19) (clear b18) (arm-empty)
   added: (holding b18) (clear b19)
   goals met: 0 of 19
40. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 19
41. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 0 of 19
42. (stack b5 b8)
   deleted: (clear b8) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b8)
   goals met: 1 of 19
43. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 1 of 19
44. (stack b9 b5)
   deleted: (clear b5) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b5)
   goals met: 2 of 19
45. (pickup b17)
   deleted: (clear b17) (on-table b17) (arm-empty)
   added: (holding b17)
   goals met: 2 of 19
46. (stack b17 b12)
   deleted: (clear b12) (holding b17)
   added: (arm-empty) (clear b17) (on b17 b12)
   goals met: 3 of 19
47. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 3 of 19
48. (stack b2 b17)
   deleted: (clear b17) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b17)
   goals met: 4 of 19
49. (pickup b18)
   deleted: (clear b18) (on-table b18) (arm-empty)
   added: (holding b18)
   goals met: 4 of 19
50. (stack b18 b2)
   deleted: (clear b2) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b2)
   goals met: 5 of 19
51. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 5 of 19
52. (stack b3 b18)
   deleted: (clear b18) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b18)
   goals met: 6 of 19
53. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 6 of 19
54. (stack b14 b16)
   deleted: (clear b16) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b16)
   goals met: 7 of 19
55. (pickup b19)
   deleted: (clear b19) (on-table b19) (arm-empty)
   added: (holding b19)
   goals met: 7 of 19
56. (stack b19 b14)
   deleted: (clear b14) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b14)
   goals met: 8 of 19
57. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 8 of 19
58. (stack b6 b19)
   deleted: (clear b19) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b19)
   goals met: 9 of 19
59. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 9 of 19
60. (stack b1 b6)
   deleted: (clear b6) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b6)
   goals met: 10 of 19
61. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 10 of 19
62. (stack b11 b4)
   deleted: (clear b4) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b4)
   goals met: 11 of 19
63. (pickup b22)
   deleted: (clear b22) (on-table b22) (arm-empty)
   added: (holding b22)
   goals met: 11 of 19
64. (stack b22 b11)
   deleted: (clear b11) (holding b22)
   added: (arm-empty) (clear b22) (on b22 b11)
   goals met: 12 of 19
65. (pickup b24)
   deleted: (clear b24) (on-table b24) (arm-empty)
   added: (holding b24)
   goals met: 12 of 19
66. (stack b24 b22)
   deleted: (clear b22) (holding b24)
   added: (arm-empty) (clear b24) (on b24 b22)
   goals met: 13 of 19
67. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 13 of 19
68. (stack b13 b24)
   deleted: (clear b24) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b24)
   goals met: 14 of 19
69. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 14 of 19
70. (stack b7 b13)
   deleted: (clear b13) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b13)
   goals met: 15 of 19
71. (pickup b23)
   deleted: (clear b23) (on-table b23) (arm-empty)
   added: (holding b23)
   goals met: 15 of 19
72. (stack b23 b7)
   deleted: (clear b7) (holding b23)
   added: (arm-empty) (clear b23) (on b23 b7)
   goals met: 16 of 19
73. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 16 of 19
74. (stack b10 b25)
   deleted: (clear b25) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b25)
   goals met: 17 of 19
75. (pickup b15)
   deleted: (clear b15) (on-table b15) (arm-empty)
   added: (holding b15)
   goals met: 17 of 19
76. (stack b15 b10)
   deleted: (clear b10) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b10)
   goals met: 18 of 19
77. (pickup b20)
   deleted: (clear b20) (on-table b20) (arm-empty)
   added: (holding b20)
   goals met: 18 of 19
78. (stack b20 b21)
   deleted: (clear b21) (holding b20)
   added: (arm-empty) (clear b20) (on b20 b21)
   goals met: 19 of 19
